
#### Terraform Format and Style 🖌  : `success`
#### Terraform Initialization ⚙ : `success`
#### Terraform Plan 📖 : `success`

<details><summary>Show Plan</summary>

```[command]/home/runner/work/_temp/02eafd5c-7b57-4ea7-8f50-28c558737f52/terraform-bin plan -var=aws_key_id=AKIARTUVRGMOVSMSG2H2 -var=aws_key_secret=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 -out=plan.in

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_s3_bucket.tf_playground_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "tf_playground_bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "test-1241vajgha12414jffhag124h"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"Environment" = "Github-Demo"
          [32m+[0m [0m"Name"        = "Demo Bucket"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {
          [32m+[0m [0m"Environment" = "Github-Demo"
          [32m+[0m [0m"Name"        = "Demo Bucket"
        }
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.in

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.in"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_s3_bucket.tf_playground_bucket[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "tf_playground_bucket" {%0A      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"%0A      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)%0A      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "test-1241vajgha12414jffhag124h"%0A      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false%0A      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)%0A      [32m+[0m [0m[1m[0mtags[0m[0m                        = {%0A          [32m+[0m [0m"Environment" = "Github-Demo"%0A          [32m+[0m [0m"Name"        = "Demo Bucket"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {%0A          [32m+[0m [0m"Environment" = "Github-Demo"%0A          [32m+[0m [0m"Name"        = "Demo Bucket"%0A        }%0A      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)%0A%0A      [32m+[0m [0mversioning {%0A          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: plan.in%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan.in"%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_s3_bucket.tf_playground_bucket[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "tf_playground_bucket" {%0A      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"%0A      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)%0A      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "test-1241vajgha12414jffhag124h"%0A      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false%0A      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)%0A      [32m+[0m [0m[1m[0mtags[0m[0m                        = {%0A          [32m+[0m [0m"Environment" = "Github-Demo"%0A          [32m+[0m [0m"Name"        = "Demo Bucket"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {%0A          [32m+[0m [0m"Environment" = "Github-Demo"%0A          [32m+[0m [0m"Name"        = "Demo Bucket"%0A        }%0A      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)%0A%0A      [32m+[0m [0mversioning {%0A          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: plan.in%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan.in"%0A
::set-output name=stderr::
::set-output name=exitcode::0
```

</details>


*Pusher: @dumitraand, Action: `pull_request`*